---
type: FamilySymbolFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FamilySymbolFilter

`Autodesk.Revit.DB.FamilySymbolFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilySymbolFilter | 2011 | `public FamilySymbolFilter ( ElementId familyId )` |
| Method | PassesFilter | — | `` |
| Property | FamilyId | 2011 | `public ElementId FamilyId { get ; }` |